test/performance/dialog/report/statistics.json
{
  "查看医疗对话页面请求" : {
    "transaction" : "查看医疗对话页面请求",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4693.540000000003,
    "medianResTime" : 4846.5,
    "minResTime" : 1601.0,
    "maxResTime" : 7483.0,
    "pct1ResTime" : 7182.1,
    "pct2ResTime" : 7315.75,
    "pct3ResTime" : 7482.15,
    "throughput" : 7.759155803848541,
    "receivedKBytesPerSec" : 31.57461155726257,
    "sentKBytesPerSec" : 1.8337067427063936
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 299,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4994.290969899667,
    "medianResTime" : 4969.0,
    "minResTime" : 1435.0,
    "maxResTime" : 9906.0,
    "pct1ResTime" : 7726.0,
    "pct2ResTime" : 8656.0,
    "pct3ResTime" : 9490.0,
    "throughput" : 15.179976646189775,
    "receivedKBytesPerSec" : 24.688632390084784,
    "sentKBytesPerSec" : 3.993806956643144
  },
  "登录请求" : {
    "transaction" : "登录请求",
    "sampleCount" : 99,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5712.323232323231,
    "medianResTime" : 5798.0,
    "minResTime" : 1435.0,
    "maxResTime" : 9906.0,
    "pct1ResTime" : 9147.0,
    "pct2ResTime" : 9414.0,
    "pct3ResTime" : 9906.0,
    "throughput" : 9.577246783399438,
    "receivedKBytesPerSec" : 2.1791977544258487,
    "sentKBytesPerSec" : 2.2346531271161845
  },
  "医疗对话请求" : {
    "transaction" : "医疗对话请求",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4584.189999999999,
    "medianResTime" : 4489.0,
    "minResTime" : 1785.0,
    "maxResTime" : 7522.0,
    "pct1ResTime" : 7214.400000000001,
    "pct2ResTime" : 7320.95,
    "pct3ResTime" : 7521.63,
    "throughput" : 6.128953174797744,
    "receivedKBytesPerSec" : 3.4832085835989215,
    "sentKBytesPerSec" : 1.9571950079676392
  }
}